WeidmullerSA/Weidos-ESP32-package/cores/weidmuller/expanded-gpio.c
#include "expanded-gpio.h"

#include "esp32-hal-i2c.h"
#include "esp32-hal-log.h"
#include "pins_arduino.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "esp32-hal-ledc.h"

static const uint8_t i2cNum = 0;
static const uint8_t i2cGeneralCallAddress = 0x00;
static const uint8_t i2cSoftReset = 0b00000110;

extern void __pinMode(uint32_t pin, uint8_t mode);
extern void __digitalWrite(uint32_t pin, uint8_t value);
extern int __digitalRead(uint32_t pin);

#define isExpandedPin(pin) (pin > 0xff)
#define expandedPinToDeviceAddress(p) ((p >> 8) & 0xff)
#define expandedPinToDeviceIndex(p) (p & 0xff)

// MCP23008
#ifdef HAVE_MCP23008
#include "peripheral-mcp23008.h"
#endif


static bool isAddressIntoArray(uint8_t addr, const uint8_t* arr, uint8_t len) {
	while (len--) {
		if (*arr++ == addr) {
			return true;
		}
	}
	return false;
}

void initExpandedGpio() {
	if (!i2cIsInit(i2cNum)) {
		if (i2cInit(i2cNum, SDA, SCL, 0) != ESP_OK) {
			return;
		}
	}

	// Reset devices
	uint8_t resetFunction = i2cSoftReset;
	if (i2cWrite(i2cNum, i2cGeneralCallAddress, &resetFunction, sizeof(resetFunction), 50) != ESP_OK) {
		return;
	}
	delay(10);


#ifdef HAVE_MCP23008
	for (int i = 0; i < NUM_MCP23008_DEVICES; ++i) {
		mcp23008_init(i2cNum, mcp23008Addresses[i]);
	}
#endif
	delay(5);
}

void pinMode(uint32_t pin, uint8_t mode) {
	if (!isExpandedPin(pin)) {
		__pinMode(pin, mode);
		return;
	}

	uint8_t addr = expandedPinToDeviceAddress(pin);
	uint8_t index = expandedPinToDeviceIndex(pin);

#ifdef HAVE_MCP23008
	if (isAddressIntoArray(addr, mcp23008Addresses, NUM_MCP23008_DEVICES)) {
		mcp23008_set_pin_mode(i2cNum, addr, index, mode);
	}
#endif
}

void digitalWrite(uint32_t pin, uint8_t value) {
	if (!isExpandedPin(pin)) {
		__digitalWrite(pin, value);
		return;
	}

	uint8_t addr = expandedPinToDeviceAddress(pin);
	uint8_t index = expandedPinToDeviceIndex(pin);


#ifdef HAVE_MCP23008
	if (isAddressIntoArray(addr, mcp23008Addresses, NUM_MCP23008_DEVICES)) {
		mcp23008_set_output(i2cNum, addr, index, value);
	}
#endif
}

int digitalRead(uint32_t pin) {
	if (!isExpandedPin(pin)) {
		return __digitalRead(pin);
	}

	uint8_t addr = expandedPinToDeviceAddress(pin);
	uint8_t index = expandedPinToDeviceIndex(pin);

#ifdef HAVE_MCP23008
	if (isAddressIntoArray(addr, mcp23008Addresses, NUM_MCP23008_DEVICES)) {
		return mcp23008_get_input(i2cNum, addr, index);
	}
#endif

	return LOW;
}

